<template>
    <PaperDoc>
        <div class="flex flex-col items-center">
          <img class="w-[120px] h-auto"
            src="https://www.saving-sskh.com/images/logo-saving.png"
            alt="Logo" />
        </div>
      <div class="mx-auto max-w-prose text-left mt-2">
        <p class="text-center font-bold">หนังสือยินยอมให้ส่วนราชการหักเงินชำระหนี้</p>
        <p class="text-center font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        <div class="text-sm">
        <p class="text-right mt-5 mb-5">เขียนที่ สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด 
            <br>วันที่......... เดือน...................... พ.ศ..........</p>
        <p>
            <span class="ml-20">ข้าพเจ้า</span> <FiLL :data="data?.name" /> 
            อายุ <FiLL :data="data?.age" />   ปี 
            ปัจจุบันอาศัยอยู่บ้านเลขที่ <FiLL :data="data?.houseNumber" /> 
            หมู่ที่ <FiLL :data="data?.village" />
            ตรอก/ซอย <FiLL :data="data?.alley" />
            ถนน <FiLL :data="data?.road" />
            ตำบล/แขวง <FiLL :data="data?.district" />
            อำเภอ/เขต <FiLL :data="data?.canton" />
            จังหวัด <FiLL :data="data?.province " />
            เบอร์โทร <FiLL :data="data?.phoneNo" />
        

        รับราชการสังกัด <span class="font-bold">โรงพยาบาลศรีสะเกษ</span> ตำแหน่ง <FiLL :data="data?.position" />
        และเป็นสมาชิก <span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> เลขทะเบียนสมาชิก <FiLL :data="data?.memberNumber" />  
        
          มีความประสงค์ให้ส่วนราชการ/ หน่วยงานที่ข้าพเจ้าสังกัดอยู่หักเงิน และนำส่งเงินให้สหกรณ์ออมทรัพย์
          ที่ข้าพเจ้าเป็นสมาชิก จึงมีหนังสือให้ความยินยอมฉบับนี้ไว้กับ <span class="font-bold">โรงพยาบาลศรีสะเกษ</span> ทั้งปัจจุบันอนาคต ดังนี้
        </p>
        <p><span class="ml-20">ข้อ 1.</span>ยินยอมให้เจ้าหน้าที่ผู้จ่ายเงินหักเงินเดือน ค่าจ้าง หรือเงินบำนาญ 
            หรือเงินบำเหน็จ หรือเงินอื่นโตที่ข้าพเจ้าพึงได้รับจากทางราชการหรือหน่วยงานที่ข้าพเจ้าสังกัดอยู่ ทั้งปัจจุบัน 
            อนาคต ตามจำนวนที่<span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> ได้แจ้งให้ในแต่ละเดือนส่งชำระหนี้ ชำระค่าหุ้น 
            หรือเงินอื่นแล้วแต่กรณีให้<span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> แทนข้าพเจ้าทุกเดือน</p>
        <p><span class="ml-20">ข้อ 2.</span>กรณีข้าพเจ้าพ้นจากการเป็นข้าราชการ/ลูกจ้างและได้รับบำเหน็จบำนาญหรือเงินอื่นใต 
            ข้าพเจ้ายินยอมให้เจ้าหน้าที่ผู้จ่ายเงินของส่วนราชการหรือหน่วยงานที่ข้าพเจ้าสังกัดอยู่หักเงินจากเงินบำเหน็จ หรือเงินป่านาญ 
            หรือเงินอื่นใดที่ข้าพเจ้าพึงได้รับจากทางราชการตามข้อ 1 ตามจำนวนที่<span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> 
            ได้แจ้งและให้ส่งเงินจำนวนดังกล่าวนั้น ให้<span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> แทนข้าพเจ้าทุกครั้ง</p>
        <p><span class="ml-20">ข้อ 3.</span>การหักเงินเดือน ค่าจ้าง เงินบำนาญ หรือเงินบำเหน็จ หรือเงินอื่นใด ไม่ว่ากรณีใด 
            ตามข้อ 2 เมื่อได้หักชำระหนี้แก่ทางราชการแล้ว(ถ้ามี) ข้าพเจ้ายินยอมให้หักเงินดังกล่าวส่งชำระหนี้ให้ 
            <span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> ก่อนเป็นอันดับแรก</p>
        <p><span class="ml-20">ข้อ 4.</span>หนังสือยินยอมให้หักเงินตามข้อ 3 นี้ ให้มีผลตั้งแต่บัดนี้เป็นต้นไปและข้าพเจ้าสัญญาว่า 
            จะไม่ถอนการให้คำยินยอมนี้ไม่ว่าทั้งหมดหรือบางส่วน จนกว่าข้าพเจ้าจะได้พ้นจากการเป็นสมาชิกของสหกรณ์ 
            หรือพ้นภาระหนี้สินที่ข้าพเจ้ามีต่อสหกรณ์ เว้นแต่จะได้รับคำยินยอมเป็นหนังสือจาก<span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span></p>
        <p><span class="ml-20">ข้อ 5.</span>ในกรณีที่ข้าพเจ้าต้องเปลี่ยนแปลงส่วนราชการที่สังกัด โดยโอนไปสังกัดส่วนราชการอื่น 
            หรือหน่วยงานอื่นของรัฐ หรือองค์กรปกครองส่วนท้องถิ่น ข้าพเจ้ายินยอมให้เจ้าหน้าที่ผู้จ่ายเงินของส่วนราชการหรือหน่วยงานของรัฐ 
            หรือองค์กรปกครองส่วนท้องถิ่นแห่งใดแห่งหนึ่ง ที่ข้าพเจ้าโอนไปสังกัดมีอำนาจ</p>
      </div>
    </div>
    </PaperDoc>
  </template>

<script setup lang="ts">
const { data } = await useFetch<any>('/api/sit2');
// Function to get the formatted string from the Date object in DD/MM/YYYY format
const formatDate = (date: string) => {
  const formattedDate = new Date(date);
  const bcYear = formattedDate.getFullYear() + 543;
  return formattedDate.toLocaleDateString('en-GB', { day: '2-digit', month: '2-digit', year: 'numeric' }).replace(/(\d+)\/(\d+)\/(\d+)/, '$1/$2/' + bcYear);
}
</script>