<template>
    <PaperDoc>
      <div class="mx-auto max-w-prose text-left">
        <p class="text-center font-bold">หนังสือยินยอมให้ส่วนราชการหักเงินชำระหนี้</p>
        <p class="text-center font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        <p class="text-right ">เขียนที่ สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด <br>วันที่ เดือน พ.ศ.</p>
        <p>
          ข้าพเจ้า......................................อายุ............ปี ปัจจุบันอาศัยอยู่
          บ้านเลขที่..................
          หมู่ที่..................
          ตรอก/ซอย..................
          ถนน..................
          ตำบล/แขวง..................
          อำเภอ/เขต..................
          จังหวัด..................
          เบอร์โทร..................
        </p>

        <p>รับราชการสังกัด <span class="font-bold">โรงพยาบาลศรีสะเกษ</span> ตำแหน่ง.................................................</p>
        <p>และเป็นสมาชิก <span class="font-bold">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</span> เลขทะเบียนสมาชิก.....................................................</p>
        <p>
          มีความประสงค์ให้ส่วนราชการ/ หน่วยงานที่ข้าพเจ้าสังกัดอยู่หักเงิน และนำส่งเงินให้สหกรณ์ออมทรัพย์
          ที่ข้าพเจ้าเป็นสมาชิก จึงมีหนังสือให้ความยินยอมฉบับนี้ไว้กับ <span class="font-bold">โรงพยาบาลศรีสะเกษ</span> ทั้งปัจจุบันอนาคต ดังนี้
        </p>
        <p><span class="ml-20">ข้อ 1.</span>ยินยอมให้เจ้าหน้าที่ผู้จ่ายเงินหักเงินเดือน ค่าจ้าง หรือเงินบำนาญ หรือเงินบำเหน็จ หรือเงินอื่นโตที่ข้าพเจ้าพึงได้รับจากทางราชการหรือหน่วยงานที่ข้าพเจ้าสังกัดอยู่ ทั้งปัจจุบัน อนาคต ตามจำนวนที่สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด ได้แจ้งให้ในแต่ละเดือนส่งชำระหนี้ ชำระค่าหุ้น หรือเงินอื่นแล้วแต่กรณีให้สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด แทนข้าพเจ้าทุกเดือน</p>
        <p><span class="ml-20">ข้อ 2.</span>กรณีข้าพเจ้าพ้นจากการเป็นข้าราชการ/ลูกจ้างและได้รับบำเหน็จบำนาญหรือเงินอื่นใต ข้าพเจ้ายินยอมให้เจ้าหน้าที่ผู้จ่ายเงินของส่วนราชการหรือหน่วยงานที่ข้าพเจ้าสังกัดอยู่หักเงินจากเงินบำเหน็จ หรือเงินป่านาญ หรือเงินอื่นใดที่ข้าพเจ้าพึงได้รับจากทางราชการตามข้อ 1 ตามจำนวนที่สหกรณ์ออมทรัพย์ โรงพยาบาลศรีสะเกษ จำกัด ได้แจ้งและให้ส่งเงินจำนวนดังกล่าวนั้น ให้สหกรณ์ออมทรัพย์โรงพยาบาล ศรีสะเกษ จำกัด แทนข้าพเจ้าทุกครั้ง</p>
        <p><span class="ml-20">ข้อ 3.</span>การหักเงินเดือน ค่าจ้าง เงินบำนาญ หรือเงินบำเหน็จ หรือเงินอื่นใด ไม่ว่ากรณีใด ตามข้อ 2 เมื่อได้หักชำระหนี้แก่ทางราชการแล้ว(ถ้ามี) ข้าพเจ้ายินยอมให้หักเงินดังกล่าวส่งชำระหนี้ให้ สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด ก่อนเป็นอันดับแรก</p>
        <p><span class="ml-20">ข้อ 4.</span>หนังสือยินยอมให้หักเงินตามข้อ 3 นี้ ให้มีผลตั้งแต่บัดนี้เป็นต้นไปและข้าพเจ้าสัญญาว่า จะไม่ถอนการให้คำยินยอมนี้ไม่ว่าทั้งหมดหรือบางส่วน จนกว่าข้าพเจ้าจะได้พ้นจากการเป็นสมาชิกของสหกรณ์ หรือพ้นภาระหนี้สินที่ข้าพเจ้ามีต่อสหกรณ์ เว้นแต่จะได้รับคำยินยอมเป็นหนังสือจากสหกรณ์ออมทรัพย์ โรงพยาบาลศรีสะเกษ จำกัด</p>
        <p><span class="ml-20">ข้อ 5.</span>ในกรณีที่ข้าพเจ้าต้องเปลี่ยนแปลงส่วนราชการที่สังกัด โดยโอนไปสังกัดส่วนราชการอื่น หรือหน่วยงานอื่นของรัฐ หรือองค์กรปกครองส่วนท้องถิ่น ข้าพเจ้ายินยอมให้เจ้าหน้าที่ผู้จ่ายเงินของส่วนราชการหรือหน่วยงานของรัฐ หรือองค์กรปกครองส่วนท้องถิ่นแห่งใดแห่งหนึ่ง ที่ข้าพเจ้าโอนไปสังกัดมีอำนาจ</p>
      </div>
    </PaperDoc>
  </template>

<script setup lang="ts">
const { data } = await useFetch<any>('/api/sit');
// Function to get the formatted string from the Date object in DD/MM/YYYY format
const formatDate = (date: string) => {
  const formattedDate = new Date(date);
  const bcYear = formattedDate.getFullYear() + 543;
  return formattedDate.toLocaleDateString('en-GB', { day: '2-digit', month: '2-digit', year: 'numeric' }).replace(/(\d+)\/(\d+)\/(\d+)/, '$1/$2/' + bcYear);
}
</script>