<template>
    <PaperDoc>
      <div class="">
        <div>&nbsp;</div>
        <p class="flex flex-col indent-8">
          ข้อที่ 8 ข้าพเจ้าได้ทำหนังสือยินยอมให้ผู้บังคับบัญชาหักเงินได้รายเดือนและเงินได้อื่นๆ จำนวน 3 ฉบับ มอบไว้ให้
        </p>
        <p class="flex flex-col">
          สหกรณ์ หน่วยงานต้นสังกัด และสำหรับข้าพเจ้าเก็บไว้เป็นหลักฐาน
        </p>
        <p class="flex flex-col indent-8">
          ข้าพเจ้าได้อ่านข้อความในหนังสือกู้เงินนี้โดยตลอดแล้วเห็นว่าถูกต้อง จึงได้ลงลายมืชื่อไว้เป็นสำคัญต่อหน้าพยาน
        </p>
        <div class="grid grid-cols-2 justify-center flex flex-col ml-8 ">
      <p class="mt-4">(ลงชื่อ)................................................................ผู้กู้</p>
      <p class="mt-4">(ลงชื่อ)................................................................พยาน(สมาชิก)</p>

      <p class=" text-right mr-20">(................................................................)</p>
      <p class=" text-right mr-20">(................................................................)</p>
    </div>
    <div class="grid grid-cols-2 justify-center flex flex-col ml-8 ">
      <p class="mt-4">(ลงชื่อ)................................................................คู่สมรถผู้กู้</p>
      <p class="mt-4">(ลงชื่อ)................................................................พยาน(สมาชิก)</p>

      <p class=" text-right mr-20">(................................................................)</p>
      <p class=" text-right mr-20">(................................................................)</p>
    </div>
    <div class="grid grid-cols-1 justify-center flex flex-col ml-9 ">
      <p class="mt-4">(ลงชื่อ)................................................................เจ้าหน้าที่สหกรณ์</p>
      <p class=" ml-10 ">(................................................................)</p>
      
    </div>
    <div class="grid grid-cols-1 justify-center flex flex-col ml-9 ">
      <p class="mt-4">(ลงชื่อ)................................................................ประธานกรรมการเงินกู้</p>
      <p class=" ml-10">(................................................................)</p>
      
    </div>
    <div class="grid grid-cols-1 justify-center flex flex-col ml-9 ">
      <p class="mt-4">(ลงชื่อ)................................................................กรรมการผู้จัดการ</p>
      <p class=" ml-10">(................................................................)</p>
      
    </div>
    <div class="grid grid-cols-1 justify-center mt-5 ">
        <div class="flex items-start">
          <div class="border-2 border-black p-2">
            <p class=" font-bold">หมายเหตุ</p>
            <p class="">1.โปรดกรอกข้อมูลให้ถูกต้องครบถ้วน โดยไม่ต้องลงวันที่</p>
            <p class="">2ให้สมาชิกสหกรณ์เป็นพยานลายมือชื่อผู้ถู <span class="font-bold  col-span-2">ยกเว้นผู้ค้ำประกันเป็นพยานไม่ได้</span></p>
            <p class="">3.เงินกู้ตามสัญญานี้อาจมีผกพันให้คู่สมรสเป็นลูกหนี้ร่วมกันกับผู้กู้ตาม ม.1490 ประมวลกฎหมายแพ่งและพาณิชย์</p>
          </div>
        </div>
        <div>&nbsp;</div>
        <div class="mt-3 px-2">


<p class="indent-20 break-all ">ข้าพเจ้า
  .......................................................................ได้รับเงินกู้จำนวน.........................................บาท
</p>

<p class="">
  (.......................................................................) ตามหนังสือผู้เงินสำหรับเงินกู้สามัญทั่วไปนี้เป็นการถูกต้องแล้ว
  </p><p> ณ วันที่....................................................
</p>

</div>

<div class="grid grid-cols-2 justify-center mt-3">
<div class="flex items-start">

</div>


<div class="">

  <p class="mt-4">(ลงชื่อ)................................................................ผู้รับเงิน</p>
  <p class="mt-4 text-right mr-20">(.........................................................................)</p>
  

</div>

</div>
<p class="mt-4 text-right ">
  (ลงชื่อ)................................................................เจ้าหน้าที่การเงิน
</p>
<p class="mt-4 text-right mr-20">(........................................................................)</p>
      </div>
    </div>  

       
      

    </PaperDoc>
  </template>