<template>
    <PaperDoc>
      <div class="flex flex-col ml-10">
        <p>
          ข้อที่ 8 ข้าพเจ้าได้ทำหนังสือยินยอมให้ผู้บังคับบัญชาหักเงินได้รายเดือนและเงินได้อื่นๆ จำนวน 3 ฉบับ มอบไว้ให้
        </p>
      </div>
      <div class="flex flex-col ">
        <p>
          สหกรณ์ หน่วยงานต้นสังกัด และสำหรับข้าพเจ้าเก็บไว้เป็นหลักฐาน
        </p>
      </div>
      <div class="flex flex-col ml-10">
        <p>
          ข้าพเจ้าได้อ่านข้อความในหนังสือกู้เงินนี้โดยตลอดแล้วเห็นว่าถูกต้อง จึงได้ลงลายมืชื่อไว้เป็นสำคัญต่อหน้าพยาน
        </p>
      </div>

    </PaperDoc>
  </template>