<template>
    <main>
      <PaperDoc>
        
          <div class="flex flex-col items-center">
            <img class="w-[120px] h-auto"
              src="https://www.saving-sskh.com/images/logo-saving.png"
              alt="Logo" />
              
          </div>
          
          <div class="flex flex-col items-end">
        </div>
  
        <p class=" text-xl text-center col-span-2">ใบสมัครเข้าเป็นสมาชิก</p>
        <p class=" text-xl text-center col-span-2">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        <p class=" text-xl text-center col-span-2 mt-4">*********************************</p>
        <div class="flex flex-col items-end mt-3 mr-6">
          <p>สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
          <p >วันที่ .................. เดือน ................. ปี ................ </p>
        </div>
  
        <div class="flex flex-col mt-1">
          <p class="mt-4">เรียน คณะกรรมการดำเนินการสหกรณ๋ออมทรัพย์ โรงพยาบาลศรีสะเกษ จำกัด</p>
        
  
        <div class="flex flex-col mr-6">
          <p class="mt-6 indent-20 ">
            ข้าพเจ้า <FiLL :data="data?.fname" /> <FiLL :data="data?.lname" /> บ้านเลขที่ <FiLL :data="data?.housenumber" /> หมู่ที่ <FiLL :data="data?.village" />
            ถนน <FiLL :data="data?.street" /> ตำบล <FiLL :data="data?.parish" /> อำเภอ <FiLL :data="data?.district" /> จังหวัด <FiLL :data="data?.province" />
            รหัสไปรษณีย์ <FiLL :data="data?.postcode" /> เบอร์โทรศัพท์ <FiLL :data="data?.tel" />   
            ได้ทราบข้อบังคับของสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด โดยตลอดแล้ว เห็นชอบในวัตถุประสงค์ จึงขอสมัครเข้าเป็นสมาชิกของสหกรณ์ฯ ในฐานะเป็นผู้เข้าซื้อขอจดทะเบียนสหกรณ์ฯ และขอให้ถ้อยคำเป็นหลักฐาน ดังต่อไปนี้.-
          </p>
          <p class="indent-20">
            ข้อ 1. ข้าพเจ้ามีอายุ ปี (เกิดวันที่.........เดือน........พ.ศ.......)เลขประจำตัวประชาชน................ เลขที่บัญชีธนาคารกรุงไทย...................
          </p>
          <p class="indent-20">
            ข้อ 2. ข้าพเจ้าเป็นข้าราชการ/ลูกจ้างประจำ/ พนักงานราชการ/พนักงานกระทรวงสาธารณสุข(ตามวุฒิ)/พนักงานกระทรวงสาธารณสุข/ลูกจ้างชั่วคราวเงินบำรุง (ตามวุฒิ)
            / ลูกจ้างชั่วคราวเงินบำรุงทำงานประจำตำแหน่งสังกัดโรงพยาบาลศรีสะเกษ ได้รับเงินเดือน..........แผนก........บาท(....................)
          </p>
          <p class="indent-20">
          ข้อ 3. ข้าพเจ้ามิได้เป็นสมาชิกในสหกรณ์ฯ อื่นซึ่งมีวัตถุประสงค์ในการให้ยืมเงิน
        </p>
        <p class="indent-20">ข้อ 4. ข้าพเจ้าได้เข้าเป็นสมาชิกในชั้นนี้ ข้าพเจ้าของแสดงความจำนงส่งเงินค่าหุ้นรายเดือนต่อสหกรณ์ฯ ในอัตราเดือนละ บาท (มูลค่าหุ้นละ 10.00 บาท)</p>
        <p class="indent-20">ข้อ 5. ข้าพเจ้าขอแถลงรายการหนี้สินทั้งหมดซึ่งข้าพเจ้ามีอยู่ดังนี้ (แสดงข้อความละเอียดของแต่ละรายคือ ชื่อและสำนักงานของเจ้าหนี้ วันเป็นหนี้ จำนวนหนี้สินตั้งแต่แรก อัตราดอกเบี้ยร้อยละต่อปี
        หลักประกันที่ให้ไว้ จำนวนต้นเงินคงเหลือ จำนวนดอกเบี้ยค้างชำระและเป็นหนี้สินเพื่อการใดให้ครบทุกรายการ)
        อย่างน้อยต้องเป็นไปตามอัตราซึ่งกำหนดไว้ในหนังสือขี้ชวน แต่ถ้าจะแสดงความจำนงสูงกว่าอัตราที่กำหนดไว้ก็ย่อมเป็นการดี
        <p>1.</p>
        <p>2.</p>
          </p>
          <p class="indent-20">ข้อ 6.ถ้าข้าพเจ้าได้เป็นสมาชิก ข้าพเจ้ามีความประสงค์ขอกู้เงินสหกรณ์ฯ เพื่อชำระหนี้ซึ่งข้าพเจ้ามีอยู่ดังกล่าวในข้อ 5 นั้น ข้าพเจ้าขอขี้แจงเหตุผลตังต่อไปนี้.</p>
          <p>&nbsp;</p>
          <p class="indent-20">ข้อ 7. ถ้าข้าพเจ้าได้เป็นสมาชิก ข้าพเจ้ายินยอมและขอร้องให้ผู้บังคับบัญชา หรือเจ้าหน้าที่จ่ายเงินได้รายเดือนของข้าพเจ้าเมื่อได้รับมอบหมายจากสหกรณ์ฯ โปรดหักจำนวนเงินค่าหุ้นรายเดือนและ
          จำนวนเงินงวดชำระหนี้ ข้าพเจ้าต้องส่งต่อสหกรณ์ฯ นั้น จากเงินเดือนของข้าพเจ้าเมื่อจ่ายเพื่อส่งต่อให้สหกรณ์ฯ ด้วย</p>
          
        </div>
        
    </div>
  
        
  
      </PaperDoc>
  
      <MorePaperDoc>
        
      </MorePaperDoc>
    </main>
  </template>
  
  <script setup lang="ts">
  const { data } = await useFetch<any>('/api/RegistMember');
  // Function to get the formatted string from the Date object in DD/MM/YYYY format
  const formatDate = (date: string) => {
    const formattedDate = new Date(date);
    const bcYear = formattedDate.getFullYear() + 543;
    return formattedDate.toLocaleDateString('en-GB', { day: '2-digit', month: '2-digit', year: 'numeric' }).replace(/(\d+)\/(\d+)\/(\d+)/, '$1/$2/' + bcYear);
  }
  </script>