<template>
    <PaperDoc>
    <div class="flex flex-col ml-5">
        <p>
            ข้อที่ 8 ข้าพเจ้าได้ทำหนังสือยินยอมให้ผู้บังคับบัญชาหักเงินได้รายเดือนและเงินอื่นๆ  จำนวน 3 ฉบับ มอบไว้ให้
        </p>
        </div> 
        <div class="flex flex-col mt-1">
          <p>สหกรณ์ หน่วยงานต้นสังกัด และสำหรับข้าพเจ้าเก็บไว้เป็นหลักฐาน</p>
        </div> 
        <div class="flex flex-col ml-5">
        <p>
            ข้าพเจ้าได้อ่านข้อความในหนังสือกู้เงินนี้โดยตลอดแล้วเห็นว่าถูกต้อง จึงได้ลงลายมือชื่อไว้เป็นสำคัญต่อหน้าพยาน
        </p>
    </div>   
    <div class="grid grid-cols-2 justify-center flex flex-col ml-8 ">
      <p class="mt-4">(ลงชื่อ)................................................................ผู้กู้</p>
      <p class="mt-4">(ลงชื่อ)................................................................พยาน(สมาชิก)</p>

      <p class=" text-right mr-20">(................................................................)</p>
      <p class=" text-right mr-20">(................................................................)</p>
    </div>
    <div class="grid grid-cols-2 justify-center flex flex-col ml-8 ">
      <p class="mt-4">(ลงชื่อ)................................................................คู่สมรสผู้กู้</p>
      <p class="mt-4">(ลงชื่อ)................................................................พยาน(สมาชิก)</p>

      <p class=" text-right mr-20">(................................................................)</p>
      <p class=" text-right mr-20">(................................................................)</p>
    </div>
    </PaperDoc>
  </template>