<template>
    <PaperDoc>
      <div class="flex flex-col items-center mt-10">
          <img class="w-[120px] h-auto"
            src="https://www.saving-sskh.com/images/logo-saving.png"
            alt="Logo" />
        </div>
      <div class="grid justify-items-center ">
        <p class="text-lg">ใบสมัครเข้าเป็นสมาชิก</p>
        <p class="text-lg">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        <p class="mt-5">***************************</p>
      </div>

      <div class="grid justify-items-center ">
        <p class="indent-80">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
        <p class="indent-80">วันที่.............เดือน..........................พ.ศ......................</p>
      </div>

      <div class="grid justify-items-start mt-6">
        <p>เรียน คณะกรรมการดำเนินการสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</p>
      </div>

      <div class="grid justify-items-start mt-6">
        <p class="indent-24">ข้าพเจ้า.........................................บ้านเลขที่....................หมู่ที่.................
            ถนน.....................ตำบล...........................อำเภอ...........................จังหวัด.............................
            รหัสไปรษณีย์.................................เบอร์โทรศัพท์..........................ได้ทราบข้อบังคับของสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด 
            โดยตลอดเเล้ว เห็นชอบในวัตถุประสงค์ จึงขอสมัครเข้าเป็นสมาชิกของสหกรณ์ฯ ในฐานะเป็นผู้เข้าซื้อขอจดทะเบียนสหกรณ์ฯ เเละขอให้ถ้อยคำเป็น
            หลักฐาน ดังต่อไปนี้.-
        </p>
        <p class="indent-24">ข้อ 1. ข้าพเจ้ามีอายุ...........ปี (เกิดวันที่.....................เดือน....................................พ.ศ.................................)
            เลขประจำตัวประชาชน................................เลขที่บัญชีธนาคารกรุงไทย.............................
        </p>
        <p class="indent-24">ข้อ 2. ข้าพเจ้าเป็นข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ/พนักงานกระทรวงสาธารณสุข
            (ตามวุฒิ)/พนักงานกระทรวงสาธารณสุข/ลูกจ้างชั่วคราวเงินบำรุง (ตามวุฒิ)/ ลูกจ้างชั่วคราวเงินบำรุง
            ทำงานประจำตำเเหน่ง...............................เเผนก.........................
            สังกัดโรงพยาบาลศรีสะเกษ ได้รับเงินเดือน.......................บาท(...............................)
        </p>
        <p class="indent-24">ข้อ 3. ข้าพเจ้ามิได้เป็นสมาชิกในสหกรณ์ฯ อื่นซึ่งมีวัตถุประสงค์ในการให้ยืมเงิน
        </p>
        <p class="indent-24">ข้อ 4. ข้าพเจ้าได้เข้าเป็นสมาชิกในชั้นนี้ ข้าพเจ้าของเเสดงความจำนงส่งเงินค่าหุ้นรายเดือน
            สหหรณ์ฯ ในอัตราเดือนละ.................. บาท (มูลค่าหุ้นละ 10.00 บาท)
        </p>
      </div>

    </PaperDoc>
  </template>