<template>
  <PaperDoc>
    <div class="text-center mt-10">
      <p>-2-</p>
    </div>
    <div class="grid justify-items-center">
      <p class="indent-8">หักเงินเดือน ค่าจ้าง หรือเงินบำนาญหรือเงินบำเหน็จ หรือเงินอื่นใดในลักษณะเดียวกันที่ข้าพเจ้ามีสิทธิจะได้รับ
        จากทางราชการ &nbsp;หน่วยงานของรัฐ หรือองค์กรปกครองส่วนท้องถิ่น &nbsp;เเล้วเเต่กรณี &nbsp;เพื่อส่งชำระหนี้ &nbsp;ชำระค่าหุ้น
        หรือเงินอื่น &nbsp;ให้<b class="font-medium text-slate-950">สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด </b>เเทนข้าพเจ้าได้ทุกเดือน
        เเละข้าพเจ้าสัญญาว่าจะถือปฤิบัติตามคำยินยอมในหนังสือฉบับนี้ทุกประการ &nbsp;เพี่ยงเเต่สหกรณ์ได้มีหนังสือเเจ้ง
        ให้ส่วนราชการ &nbsp;หรือให้หน่วยงานของรัฐ หรือองค์กรปกครองส่วนท้องถิ่นที่ข้าพเจ้าสังกัดอยู่เพื่อดำเนินการ ดังกล่าวข้างต้นเเทนข้าพเจ้าก็เพียงพอเเล้ว
      </p>
    </div>
    <div class="grid justify-items-right whitespace-break-spaces mx-16">
        <p class="text-sm text-right">หนังสือยินยอมฉบับนี้ทำขึ้นโดยความสมัครใจของข้าพเจ้าเอง ได้ตรวจสอบข้อความและ
        </p>
    </div>
    <div class="grid justify-items-left ms-16">
      <p class="text-sm text-balance  ms-2">ถ้อยคำในหนังสือนี้ทั้งหมดเเล้ว ตรงตามเจตนารมณ์ของข้าพเจ้าทุกประการ จึงลงลายมือชื่อไว้เป็นสำคัญ<br>
      </p>
    </div>
    <div class="grid justify-items-right whitespace-break-spaces mx-16">
        <p class="text-sm text-right mx-5 font-medium text-slate-950">หนังสือนี้ทำขึ้น 3 ฉบับ มีข้อมความตรงกัน ฉบับที่หนึ่งเก็บไว้ที่โรงพยาบาลศรีสะเกษ
        </p>
    </div>
    <div class="grid justify-items-left ms-16">
      <p class="text-sm text-balance  ms-2 text-slate-950">ฉบับที่สองเก็บไว้ที่ข้าพเจ้า &nbsp;เเละฉบับที่สามให้ไว้กับสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ &nbsp;จำกัด
      </p>
    </div>
    <div class="grid grid-cols-0 justify-center mt-8 ms-16 ">
        <div class="flex items-start">

        </div>


        <div class="">

          <p class="text-sm mt-5 ms-16">ลงชื่อ................................................................................ให้คำยินยอม(ผู้สมัคร)</p>
          <p class="mt-4 text-center mr-6">
        (................................................................)</p>

        </div>
        <div class="">

          <p class="text-sm mt-16 ms-16">ลงชื่อ................................................................................พยาน(สมาชิก)</p>
          <p class="mt-4 text-center mr-6">
        (................................................................)</p>

        </div>
        <div class="">

          <p class="text-sm mt-16 ms-16">ลงชื่อ................................................................................พยาน(สมาชิก)</p>
          <p class="mt-4 text-center mr-6">
        (................................................................)</p>

        </div>

      </div>
  </PaperDoc>
</template>