<template>
  <PaperDoc>
    <div class="flex flex-col items-center">
      <img class="w-[120px] h-auto" src="https://www.saving-sskh.com/images/logo-saving.png" alt="Logo" />
    </div>
    <div class="text-center mt-3">
      <p class="text-black text-lg">หนังสือให้ความยินยอมหักเงิน</p>
    </div>
    <div class="flex flex-col mx-20 mt-7 ">
      <p class="text-sm leading-7 mr-1">
        <div class="grid grid-cols-2 gap-2">
        <div></div>
  <div class="tracking-tight">เขียนที่ สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด</div>
  <div></div>
  <div>0859 ถนนกสิกรรม ตำบลเมืองใต้</div>
  <div></div>
  <div>อำเภอเมือง จังหวัดศรีสะเกษ 33000</div>
  <div></div>
</div>
<div class="pl-60">วันที่.................เดือน....................................................พ.ศ....................</div>
        เรียน ประธานกรรมการสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด<br />
        <div class="tracking-wide">ข้าพเจ้า.............................................................................................................เป็นข้าราชการ/ลูกจ้างประจำ/</div>
        <div class="tracking-normal"> พนักงานราชการ/พนักงานกระทรวงสาธารณสุข&nbsp&nbsp (ตามวุฒิ) /พนักงานกระทรวงสาธารณสุข/ลูกจ้างชั่วคราว</div>
        <div class="tracking-tighter">เงินบำรุง(ตามวุฒิ)/ ลูกจ้างชั่วคราวเงินบำรุง ตำแหน่ง................................................................................................ สังกัดโรงพยาบาล</div>
        <div class="tracking-wide">ศรีสะเกษ เป็นสมาชิกสหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จำกัด เลขทะเบียน.................................</div>
        <div class="tracking-wide">และยินยอมให้สหกรณ์ออมทรัพย์โรงพยาบาลศรีสะเกษ จํากัด หักเงินที่ข้าพเจ้าได้รับเงินเดือน ค่าจ้าง</div>
        <div class="tracking-wider">เงินบํานาญ เงินบำเหน็จ เงินบําเหน็จตกทอด กบข. ฌกส. หรือเงินอื่นใดที่ข้าพเจ้ามีสิทธิได้รับจาก</div>
        <div class="tracking-tight">ส่วนราชการต้นสังกัด&nbsp&nbsp เพื่อชําระค่าหุ้นหรือหนี้ตามสัญญากู้เงิน &nbspไม่ว่าจะเป็นหนี้เงินต้นและดอกเบี้ย &nbsp&nbspค่าอุปกรณ์</div>
        <div class="tracking-normal">แห่งหนี้และค่าเสียหายตามที่ปรากฏในสัญญากู้ได้เต็มจํานวน&nbsp &nbspทั้งนี้โดยไม่ต้องบอกกล่าวให้ผู้ยินยอมหรือ</div>
        <div class="tracking-normal">ผู้รับผลประโยชน์ทราบล่วงหน้าก่อน</div>
      </p>
    </div>
    <br>
    <br>
    <div class="pl-64">ลงชื่อ.................................................ผู้ให้คำยินยอม (ผู้สมัคร)</div>
    <div class="pl-72">(...................................................)</div>
    <br>
    <div class="pl-64">ลงชื่อ.................................................พยาน(ผู้รับประโยชน์)</div>
    <div class="pl-72">(...................................................)</div>
    <div class="pl-72">เกี่ยวข้องเป็น............................</div>
    <div class="pl-72">&nbspเบอร์โทร...................................</div>
    <br>
    <br>
    <div class="pl-64">ลงชื่อ.................................................พยาน(หัวหน้าฝ่ายการเงิน)</div>
    <div class="pl-72">(...................................................)</div>
    <br>
    <br>
    <div class="pl-64">ลงชื่อ.................................................ผู้อำนวยการโรงพยาบาลศรีสะเกษ</div>
    <div class="pl-72">(...................................................)</div>
    <br>
  </PaperDoc>
</template>
